uses
  System;
begin
  var a : Integer; // Текущий код
	var b : Integer; // Целевой код
	var m : Integer; // Количество цифр целевого кода
	var n : Integer; // Количесво цифр текущего кода
	var total_moves : Integer; // число перемещений дисков кодового замка
	// Временные переменные для работы с комбинациями кодового замка
	var a1, b1 : Integer; 
	// Ввод данных: целевой и текущий код
	// вводятся как четырехзначные числа
	Console.Write('Введите текущий код: ');
	Integer.TryParse(Console.ReadLine(), a);
	Console.Write('Введите целевой код: ');
	Integer.TryParse(Console.ReadLine(), b);
	a1 := a; b1 := b;
	// Количество цифр текущего кода
	while (a1 > 0) do // Условие выполнения цикла
	begin
		m += 1; // Счётчик числа цифр увеличили на 1
		a1 := a1 div 10; // Число уменьшили в 10 раз
	end;
	// Количество цифр целевого кода
	while (b1 > 0) do // Условие выполнения цикла
	begin
	  n += 1; // Счётчик числа цифр увеличили на 1
		b1 := b1 div 10; // Число уменьшили в 10 раз
	end;
	// Проверка на совпадение длины текущего и целевого кода
	// Если длина текущего кода не равна длине целевого
	// и оба кода не четырёхзначные, программа завершает работу.
	if (m <> 4) or (n <> 4) or (m <> n) then
  begin
		Console.WriteLine('Комбинация кодового замка должна быть 4 цифры.');
		Console.WriteLine('Текущий и целевой код должны быть одинаковой длины.');
		Console.Read(); // Задержка вывода до нажатия клавиши "Ввод"
		Environment.Exit(0); // Выход из программы
	end;
	a1 := a; b1 := b;
	// Перебор цифр текущего и целевого кода
	while (a1 > 0) and (b1 > 0) do
  begin
		var d1 := a1 mod 10; // Цифра текущего кода
		var d2 := b1 mod 10; // Цифра целевого кода
		var diff1 := Math.Abs(d1 - d2); // разность цифр, прямой ход диска
		var diff2 := 10 - Math.Abs(d1 - d2); // разность цифр, обратный ход диска
		// Мнинимальное число ходов - разность между каждой цифрой диска
		// в целевом коде и текущем коде замка сейфа
		total_moves += Math.Min(diff1, diff2);
		a1 := a1 div 10; // Переход к следующей цифре текущего кода
		b1 := b1 div 10; // Переход к следующей цифре целевого кода
	end;
	// Вывод информации на экран
	Console.WriteLine($'Текущий код:{a}');
	Console.WriteLine($'Целевой код:{b}');
	Console.WriteLine($'Мнинимальное число ходов:{total_moves}');
	Console.Read(); // Задержка вывода до нажатия клавиши "Ввод"
end.